// На входе число на выходе квадрат
// int number = 5;
// int result =  number*number;
// Console.WriteLine(result);


//Два числа на входе на выходе квадрат 
// Числа вводятся с консоли
// Console.WriteLine ("введите первое число");
// int number_f = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine ("введите второе число");
// int number_s = Convert.ToInt32(Console.ReadLine());

// if (number_f == number_s*number_s)
// {
//     Console.WriteLine ("Первая переменная является квадратом второй");
// }
// else
// {
//     Console.WriteLine ("Первая переменная Не является квадратом второй");
// }


//если number_f == number_s*number_s
// занчит равно


// Напишите программу вычисляющую значение функции числа в квадрате

// int Power(int number)
//     {
//          int result = number*number;
//          return result;
//     }
// // // функция

// Console.WriteLine("Введите число");
// int num = Convert.ToInt32(Console.ReadLine());

// int result = Power(num);

// Console.WriteLine(Power(num));


// Напишите программу вычисляющую значение функции числа в квадрате
// в сокращенном варианте

// int Power(int number)
//     {
//         return number*number;
//     }
// // // функция

// Console.WriteLine("Введите число");
// int num = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine(Power(num));


// На входе число на выходе целые числа от N lj -N

// void Task7()

// {Console.WriteLine("Введите число");
// int num = Convert.ToInt32(Console.ReadLine());
// num = Math.Abs(num);

// int counter = - num;

// // выводим числа до тех пор пока не достигнем нужного числа
//     while (counter <= num)
//     {
//         Console.Write(counter+ ", ");
//         counter++;
//     }
// }

//  Task7();